yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152c6.h
/* DAC data output register low */
__IO_REG8    (DAC_DORL,    0x53AD, __READ);

/*-------------------------------------------------------------------------
 *      DAC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define DAC_CR1_EN               DAC_CR1_bit.EN
#define DAC_CR1_BOFF             DAC_CR1_bit.BOFF
#define DAC_CR1_TEN              DAC_CR1_bit.TEN
#define DAC_CR1_TSEL             DAC_CR1_bit.TSEL

#define DAC_CR2_DMAEN            DAC_CR2_bit.DMAEN
#define DAC_CR2_DMAUDRIE         DAC_CR2_bit.DMAUDRIE

#define DAC_SWTRIGR_SWTRIG       DAC_SWTRIGR_bit.SWTRIG

#define DAC_SR_DMAUDR            DAC_SR_bit.DMAUDR

#define DAC_RDHRH_RDHRH          DAC_RDHRH_bit.RDHRH

#define DAC_LDHRL_LDHRL          DAC_LDHRL_bit.LDHRL

#define DAC_DORH_DORH            DAC_DORH_bit.DORH

#endif

/*-------------------------------------------------------------------------
 *      DAC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_DAC_CR1_EN          0x01
#define MASK_DAC_CR1_BOFF        0x02
#define MASK_DAC_CR1_TEN         0x04
#define MASK_DAC_CR1_TSEL        0x38

#define MASK_DAC_CR2_DMAEN       0x10
#define MASK_DAC_CR2_DMAUDRIE    0x20

#define MASK_DAC_SWTRIGR_SWTRIG  0x01

#define MASK_DAC_SR_DMAUDR       0x01

#define MASK_DAC_RDHRH_RDHRH     0x0F

#define MASK_DAC_LDHRL_LDHRL     0xF0

#define MASK_DAC_DORH_DORH       0x0F


/*-------------------------------------------------------------------------
 *      LCD register definitions
 *-----------------------------------------------------------------------*/
/* LCD control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char B2          : 1;
  unsigned char DUTY0       : 1;
  unsigned char DUTY1       : 1;
  unsigned char BLINKF0     : 1;
  unsigned char BLINKF1     : 1;
  unsigned char BLINKF2     : 1;
  unsigned char BLINK0      : 1;
  unsigned char BLINK1      : 1;
} __BITS_LCD_CR1;
#endif
__IO_REG8_BIT(LCD_CR1,     0x5400, __READ_WRITE, __BITS_LCD_CR1);

/* LCD control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VSEL        : 1;
  unsigned char CC0         : 1;
  unsigned char CC1         : 1;
  unsigned char CC2         : 1;
  unsigned char HD          : 1;
  unsigned char PON0        : 1;
  unsigned char PON1        : 1;
  unsigned char PON2        : 1;
} __BITS_LCD_CR2;
#endif
__IO_REG8_BIT(LCD_CR2,     0x5401, __READ_WRITE, __BITS_LCD_CR2);

/* LCD control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DEAD0       : 1;
  unsigned char DEAD1       : 1;
  unsigned char DEAD2       : 1;
  unsigned char SOFC        : 1;
  unsigned char SOF         : 1;
  unsigned char SOFIE       : 1;
  unsigned char LCDEN       : 1;
} __BITS_LCD_CR3;
#endif
__IO_REG8_BIT(LCD_CR3,     0x5402, __READ_WRITE, __BITS_LCD_CR3);

/* LCD frequency selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DIV0        : 1;
  unsigned char DIV1        : 1;
  unsigned char DIV2        : 1;
  unsigned char DIV3        : 1;
  unsigned char PS0         : 1;
  unsigned char PS1         : 1;
  unsigned char PS2         : 1;
  unsigned char PS3         : 1;
} __BITS_LCD_FRQ;
#endif
__IO_REG8_BIT(LCD_FRQ,     0x5403, __READ_WRITE, __BITS_LCD_FRQ);

/* LCD Port mask register 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG00       : 1;
  unsigned char SEG01       : 1;
  unsigned char SEG02       : 1;
  unsigned char SEG03       : 1;
  unsigned char SEG04       : 1;
  unsigned char SEG05       : 1;
  unsigned char SEG06       : 1;
  unsigned char SEG07       : 1;
} __BITS_LCD_PM0;
#endif
__IO_REG8_BIT(LCD_PM0,     0x5404, __READ_WRITE, __BITS_LCD_PM0);

/* LCD Port mask register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG08       : 1;
  unsigned char SEG09       : 1;
  unsigned char SEG10       : 1;
  unsigned char SEG11       : 1;
  unsigned char SEG12       : 1;
  unsigned char SEG13       : 1;
  unsigned char SEG14       : 1;
  unsigned char SEG15       : 1;
} __BITS_LCD_PM1;
#endif
__IO_REG8_BIT(LCD_PM1,     0x5405, __READ_WRITE, __BITS_LCD_PM1);

/* LCD Port mask register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG16       : 1;
  unsigned char SEG17       : 1;
  unsigned char SEG18       : 1;
  unsigned char SEG19       : 1;
  unsigned char SEG20       : 1;
  unsigned char SEG21       : 1;
  unsigned char SEG22       : 1;
  unsigned char SEG23       : 1;
} __BITS_LCD_PM2;
#endif
__IO_REG8_BIT(LCD_PM2,     0x5406, __READ_WRITE, __BITS_LCD_PM2);

/* LCD Port mask register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG24       : 1;
  unsigned char SEG25       : 1;
  unsigned char SEG26       : 1;
  unsigned char SEG27       : 1;
} __BITS_LCD_PM3;
#endif
__IO_REG8_BIT(LCD_PM3,     0x5407, __READ_WRITE, __BITS_LCD_PM3);

/* LCD display memory 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S000        : 1;
  unsigned char S001        : 1;
  unsigned char S002        : 1;
  unsigned char S003        : 1;
  unsigned char S004        : 1;
  unsigned char S005        : 1;
  unsigned char S006        : 1;
  unsigned char S007        : 1;
} __BITS_LCD_RAM0;
#endif
__IO_REG8_BIT(LCD_RAM0,    0x540C, __READ_WRITE, __BITS_LCD_RAM0);

/* LCD display memory 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S008        : 1;
  unsigned char S009        : 1;
  unsigned char S010        : 1;
  unsigned char S011        : 1;
  unsigned char S012        : 1;
  unsigned char S013        : 1;
  unsigned char S014        : 1;
  unsigned char S015        : 1;
} __BITS_LCD_RAM1;
#endif
__IO_REG8_BIT(LCD_RAM1,    0x540D, __READ_WRITE, __BITS_LCD_RAM1);

